tutorials/rheoEFoam/EKI/Ohmic/0/phiE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      phiE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inletNorth
    {
        type            fixedValue;
        value           uniform 33;
    }
    inletSouth
    {
        type            fixedValue;
        value           uniform 33;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletWest
    {
        type            fixedValue;
        value           uniform 34.65;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
