tutorials/rheoEFoam/EKI/Ohmic/0/sigma.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -3 3 0 0 2 0];

internalField   uniform .4;

boundaryField
{
    inletNorth
    {
	type            fixedValue;
	value           uniform .4;
    }
    
    inletSouth
    {
	type            fixedValue;
	value           uniform .4;
    }
    
    inletWest
    {
	type            fixedValue;
	value           uniform 4;
    }
   
    "(walls|frontAndBack)"
    {
	type            zeroGradient;       
    }

    outlet
    {
	type            zeroGradient;         
    }     
}

// ************************************************************************* //
